zhi-z/other/实验室内部培训课件/2016.1.31串口通讯/AT89C52串口/UART.C

/*******************************************************************************
* 文件名 : UART.C

* 版本     作者            日期            说明
* V1.0                  2015/08/03       初始版本

* 描述   : MCU:      晶振:    MHz
           
*******************************************************************************/

#include "uart.h"
#include <reg52.H>

unsigned char date = 0,flag;
sbit FM = P2^3 ;
sbit led_0 = P1^0 ;
sbit led_1 = P1^1 ;
sbit led_2 = P1^2 ;
sbit led_3 = P1^3 ;
sbit led_4 = P1^4 ;
sbit led_5 = P1^5 ;
sbit led_6 = P1^6 ;
sbit led_7 = P1^7 ;

/*******************************************************************************
* 功能描述 : 51单片机的串口初始化
* 函数属性 : 外部
* 输入参数 : 无
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/

void UartInit(void)		//115200bps@22.1184MHz
{
	TMOD |=0x20;   //设置定时器T/C1工作在方式2,定时1工作于自动重载模式 TMOD= TMOD|0x20 表示将TMOD的第5位置1，而后者表示直接赋值

	SCON=0x50;     //设置串行口工作方式1：SCON格式 |M0|M1|M2|REN|TB8|RB8|TI|RI
	TH1=0xfd;      //波特率9600
	TL1=0xfd;
	ET1 = 0;		//禁止定时器1中断
	TR1 = 1;		//启动定时器1
	EA = 1;
	ES = 1;
	UART_Send_Str("串口初始化完毕!\n");
}

/*******************************************************************************
* 功能描述 : 51单片机的串口中断处理函数
* 函数属性 : 外部
* 输入参数 : 无
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/

void UART_inter() interrupt 4    //串口中断函数
{

	date=SBUF;        //取出接受到的数据
	if(date == 2+0X30)
	{
		FM = 1;
		led_0 = 1;
		led_2 = 1;
		led_4 = 1;
		led_6 = 1;
	}
	if(date == 1+0X30)
	{
		FM = 0;
		led_0 = 0;
		led_2 = 0;
		led_4 = 0;
		led_6 = 0;
	}
	RI=0;			  //清除接受中断标志位
//	flag = 0;
}

/*******************************************************************************
* 功能描述 : 51单片机的串口发送一个字节的函数
* 函数属性 : 外部
* 输入参数 : unsigned char mydata,要发送的一个字节内容
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/

void UART_Send_Byte(unsigned char mydata)	
{
    ES=0;
//    TI=0;
    SBUF=mydata;
    while(!TI);
    TI=0;
    ES=1;
}
 
/*******************************************************************************
* 功能描述 : 串口发送0d和0a两个字节,即回车换行,在串口助手上有回车换行的效果
* 函数属性 : 外部
* 输入参数 : 无
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/

void UART_Send_Enter()
{
    UART_Send_Byte(0x0d);  
    UART_Send_Byte(0x0a);  
}

/*******************************************************************************
* 功能描述 : 单片机的串口发送字符串
* 函数属性 : 外部
* 输入参数 : char *s ,指向字符串的指针
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/

void UART_Send_Str(char *s)
{
    int idata len=strlen(s)-1; 	//减一是因为数组的存储从0开始
	int idata i;
	/*
	strlen用来计算字符串的长度；idata是数据被定义在单片机内部的RAM区
	头文件：string.h
	格式：strlen(字符数组名)
	功能：计算字符串S的（unsigned int型）长度，不包括'\0'
	说明：返回s的长度，不包括结束符。
	
	*/
    

    for(i=0;i<len;i++)
    {
        UART_Send_Byte(s[i]);
    }
    
    if(s[i]=='\n') 
    {
        UART_Send_Enter();
    }
    else
    {
        UART_Send_Byte(s[i]);
    }
}

/*******************************************************************************
* 功能描述 : 串口发送数值,函数会将数值转为相应的字符串,如 45 转为 "45"再发送出去
* 函数属性 : 外部
* 输入参数 : unsigned long dat,要发送的数值
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/

void UART_Put_Num(unsigned long dat)
{
    char idata temp[20];
    u32_to_str(dat,temp); //把数值转为字符
    UART_Send_Str(temp);
	UART_Send_Enter();
}

/*******************************************************************************
* 功能描述 : 单片机的串口发送调试信息
* 函数属性 : 外部
* 输入参数 : inf:指向提示信息字符串的指针,dat:数值,提示信息就是这个数值的描述
* 返回参数 : 无
* 函数详解 :  
      
*******************************************************************************/

void UART_Put_Inf(char *inf,unsigned long dat)
{
    UART_Send_Str(inf);     //输出的提示信息,用来描述数值
    UART_Put_Num(dat);      //输出数值
    UART_Send_Str("\n");    //换行
}

/*******************************************************************************
* 功能描述 : 将一个32位的变量dat转为字符串，比如把1234转为"1234"
* 函数属性 : 外部
* 输入参数 : dat:待转换的变量,str:指向字符数组的指针，转换后的字节串放在其中
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/

void u32_to_str(unsigned long dat,char *str) 
{
    char idata temp[20];
    unsigned char idata i=0,j=0;
    
	i=0;
    while(dat)
    {
        temp[i]=dat%10+0x30;    //求余  余数加上0X30转换成SACII码
        i++;		            //例如：把123转化成"123"	  i = 3
        dat/=10;	            //dat = dat/10 ,unsigned char类型，所以结果自动取整
    }
    
    j=i;
    for(i=0;i<j;i++)
    {
        str[i]=temp[j-i-1];
    }
    
//    if(!i) 
//	{
//		str[i++]='0';	 //i++先自增
//	}
//    str[i]=0;
}

/*******************************************************************************
* 功能描述 : 将一个字符串转为32位的变量，比如"1234"转为1234
* 函数属性 : 外部
* 输入参数 : char *str,指向待转换的字符串的指针
* 返回参数 : unsigned long temp ,转换后的数值
* 函数详解 : 
      
*******************************************************************************/

unsigned long str_to_u32(char *str) 
{
    unsigned long idata temp=0;
    unsigned long idata fact=1;
    unsigned char idata len=strlen(str);
    unsigned char idata i;

    for(i=len;i>0;i--)
    {
        temp += ((str[i-1]-0x30)*fact);
        fact *= 10;
    }
    return temp;
}


/*******************************************************************************
* 功能描述 : 将数值转换为字符串,如 15 转为 "000F"
* 函数属性 : 外部
* 输入参数 : hex 要转换的数值, str 指向用来保存结果的数组的指针
* 返回参数 : unsigned char 0 
* 函数详解 : 
      
*******************************************************************************/


unsigned char Hex2Str_16b(unsigned int hex,char *str)
{
    unsigned char temp=0;

    temp=((hex&0xf000)>>12);
    str[0]=(temp>=10)?(temp-10+'A'):(temp+0x30);

    temp=((hex&0x0f00)>>8);
    str[1]=(temp>=10)?(temp-10+'A'):(temp+0x30);

    temp=((hex&0x00f0)>>4);
    str[2]=(temp>=10)?(temp-10+'A'):(temp+0x30);

    temp=((hex&0x000f)>>0);
    str[3]=(temp>=10)?(temp-10+'A'):(temp+0x30);

    str[4]=0;

    return 0;
}

/*******************************************************************************
* 功能描述 : 将数值以16进制输出到串口,能显示的最大值为 65535
* 函数属性 : 外部
* 输入参数 : 要输出显示的数值
* 返回参数 : 无
* 函数详解 : 
      
*******************************************************************************/


void UART_Put_Hex(unsigned int hex)
{
    char temp[20];
    Hex2Str_16b(hex,temp);
    UART_Send_Str(temp);
}

//void main()
//{
//	unsigned char i = 7 ;
//	UartInit();       //串口初始化
//	UART_Send_Str("hello\n"); //发送字符串
//	UART_Put_Num(i);    //以10进制形式显示数值大小
//	UART_Send_Enter();			//回车换行
//	UART_Put_Hex(15);	//以16进制形式显示数值大小
//	UART_Send_Enter();			//回车换行
//	UART_Put_Inf("i= ",i);	// 本语句在这里的输出结果为  i=7
//	UART_Send_Byte(48);		//输出一个48,48对应的ascll码字符为'0',所以本语句显示内容为  0
//	while(1);
//}
